Autodesk.Revit.DB.HermiteSpline.Create(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.HermiteSplineTangents)
Creates a Hermite spline with specified tangency at its endpoints.
controlPoints:
The control points of the Hermite spline.
periodic:
True if the Hermite spline is to be periodic, false otherwise.
tangents:
The object which indicates tangency at the start, the end, or both ends of the curve.
Returns:
The new HermiteSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The control points array is invalid, because it doesn't contain the minimum number of points (2).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to construct valid HermiteSpline from given inputs.
Since:
2014

Autodesk.Revit.DB.HermiteSpline.Create(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean)
Creates a Hermite spline with default tangency at its endpoints.
Remarks:
The tangents at the ends of the spline are computed from the control points.
controlPoints:
The control points of the Hermite spline.
periodic:
True if the Hermite spline is to be periodic, false otherwise.
Returns:
The new HermiteSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The control points array is invalid, because it doesn't contain the minimum number of points (2).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to construct valid HermiteSpline from given inputs.
Since:
2014

Autodesk.Revit.DB.HermiteSpline.Parameters
Returns the params of the Hermite spline.

Autodesk.Revit.DB.HermiteSpline.Tangents
Returns the tangents of the Hermite spline.

Autodesk.Revit.DB.HermiteSpline.ControlPoints
The control points of the Hermite spline.

Autodesk.Revit.DB.HermiteSpline.IsPeriodic
Returns whether the Hermite spline is periodic or not.

Autodesk.Revit.DB.HermiteSpline
A Hermite spline.
Remarks: The Hermite spline lies in the plane defined by control points.